
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_branch_protection.default_branch["cursor"] has changed
  ~ resource "github_branch_protection" "default_branch" {
      + force_push_bypassers            = []
        id                              = "BPR_kwDOOis7XM4Dt-Tk"
      + push_restrictions               = []
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repos["cursor"] has changed
  ~ resource "github_repository" "repos" {
      ~ etag                        = "W/\"1a19dbe7f3c427c1a8dd6ce602982d14a8386a00a105fc838cfa8966ce562716\"" -> "W/\"97735d66bdd6c9c57992ebbdb90f349e551af43d25d136e6e1e2f575c7c20bbc\""
        id                          = "template-cursor"
        name                        = "template-cursor"
      + primary_language            = "Shell"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.default_branch["nuxt-ucda"] will be created
  + resource "github_branch_protection" "default_branch" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_status_checks {
          + contexts = [
              + "pre-commit",
            ]
          + strict   = true
        }
    }

  # github_repository.repos["cursor"] will be updated in-place
  ~ resource "github_repository" "repos" {
        id                          = "template-cursor"
        name                        = "template-cursor"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.repos["nuxt-ucda"] will be created
  + resource "github_repository" "repos" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "UCDA Nuxt repository created from template-cursor"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "nuxt-ucda"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "private"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "surefirev2"
          + repository           = "template-cursor"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ repository_names = {
      + nuxt-ucda = (known after apply)
        # (1 unchanged element hidden)
    }
  ~ repository_urls  = {
      + nuxt-ucda = (known after apply)
        # (1 unchanged element hidden)
    }

<!-- Sticky Pull Request Commentterraform-plan -->